; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v4 ?v9)
             (pred_3 ?v8 ?v2)
             (pred_11 ?v4 ?v2)
             (pred_7 ?v6 ?v4 )
	     (pred_9 ?v4)
             (pred_10 ?v12)
             (pred_4 ?v8)
             (pred_5 ?v2)
             (pred_12 ?v4)
             (pred_1 ?v8)
             (pred_6 ?v4)
             (pred_8 ))



(:action op_2
:parameters (?v1 ?v13 ?v5 ?v10)
:precondition (and (pred_10 ?v1) (pred_10 ?v13) (pred_4 ?v5) (pred_5 ?v10)
          (pred_2 ?v1 ?v13) (pred_3 ?v5 ?v10)
                   (pred_11 ?v13 ?v10) (pred_9 ?v1) 
                   (pred_12 ?v13) (pred_1 ?v5))
:effect (and  (pred_6 ?v13) (not (pred_12 ?v13))))


(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_10 ?v1) (pred_10 ?v3)
               (pred_9 ?v1) (pred_2 ?v1 ?v3) (pred_6 ?v3))
:effect (and (pred_9 ?v3) (not (pred_9 ?v1))))

(:action op_3
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_4 ?v5) 
                  (pred_9 ?v1) (pred_7 ?v5 ?v1) (pred_8 ))
:effect (and (pred_1 ?v5)
   (not (pred_7 ?v5 ?v1)) (not (pred_8 ))))


(:action op_1
:parameters (?v1 ?v7 ?v11)
:precondition (and (pred_10 ?v1) (pred_4 ?v7) (pred_4 ?v11)
                  (pred_9 ?v1) (pred_1 ?v11) (pred_7 ?v7 ?v1))
:effect (and (pred_1 ?v7) (pred_7 ?v11 ?v1)
        (not (pred_1 ?v11)) (not (pred_7 ?v7 ?v1))))

(:action op_5
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_4 ?v5) 
                  (pred_9 ?v1) (pred_1 ?v5))
:effect (and (pred_8 ) (pred_7 ?v5 ?v1) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_16 obj_04 obj_10 obj_07 obj_11 obj_15 obj_03 obj_20 obj_21 obj_14 obj_17 obj_01 obj_08 obj_06 obj_19
    obj_12 obj_18
    obj_09 obj_05 obj_13
    )

    (:init
       (pred_8)

       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_21)
       (pred_10 obj_14)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_19)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_13)

       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_16)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_15 obj_14)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_15 obj_11)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_20 obj_01)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_14 obj_17)
       (pred_2 obj_14 obj_15)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_14)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_20)
       (pred_2 obj_08 obj_06)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_06 obj_08)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_11  obj_02 obj_12)
       (pred_11  obj_19 obj_18)
       (pred_11  obj_14 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_06)

       (pred_3  obj_09 obj_12)
       (pred_3  obj_05 obj_18)
       (pred_3  obj_13 obj_18)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_13 obj_04)
       (pred_9 obj_01)
    )

    (:goal (and
       (pred_7 obj_13 obj_07)
    ))
(:constraints
  (always (not (pred_9 obj_16)))
)
)

; plan
1. (op_4 obj_01 obj_08)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_05)
   deleted: (pred_7 obj_05 obj_08) (pred_8)
   added: (pred_1 obj_05)
   goals met: 0 of 1
3. (op_4 obj_08 obj_21)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_21)
   goals met: 0 of 1
4. (op_4 obj_21 obj_11)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_15)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_15)
   goals met: 0 of 1
6. (op_4 obj_15 obj_04)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_04)
   goals met: 0 of 1
7. (op_1 obj_04 obj_13 obj_05)
   deleted: (pred_1 obj_05) (pred_7 obj_13 obj_04)
   added: (pred_1 obj_13) (pred_7 obj_05 obj_04)
   goals met: 0 of 1
8. (op_4 obj_04 obj_15)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_15)
   goals met: 0 of 1
9. (op_4 obj_15 obj_11)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_11)
   goals met: 0 of 1
10. (op_4 obj_11 obj_07)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_07)
   goals met: 0 of 1
11. (op_5 obj_07 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_8) (pred_7 obj_13 obj_07)
   goals met: 1 of 1
